app/views/teachers/achievements.html.erb

    <tr>
      <%= display_achievements(Achievement.all) %>
---
SELECT "achievements".* FROM "achievements"