app/views/teachers/index.html.erb

  <tbody>
      <% Student.get_all_children_for_teacher_id( session[:teacher_id] ).each do |student| %>
---
SELECT "students".* FROM "students"
SELECT "teachers".* FROM "teachers"


        <%= display_achievements(Achievement.all) %>
---
SELECT "achievements".* FROM "achievements"


<%= link_to 'Change your password', edit_teacher_path(Teacher.find_by(id: session[:teacher_id] )) %>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]