app/controllers/achievements_controller.rb

def create
  @achievement = Achievement.new(achievement_params)
  respond_to do |format|
    if @achievement.save
---
INSERT INTO "achievements" ("description", "point_value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "explode"], ["point_value", 900], ["created_at", "2015-02-09 20:42:50.022371"], ["updated_at", "2015-02-09 20:42:50.022371"]]

def set_achievement
  @achievement = Achievement.find(params[:id])
---
SELECT  "achievements".* FROM "achievements" WHERE "achievements"."id" = ? LIMIT 1  [["id", 1]]