app/controllers/students_controller.rb

  def edit_achievements
    @achievements = Achievement.all
---
SELECT "achievements".* FROM "achievements"