app/controllers/teachers_controller.rb

  def achievements
    @students = Student.all
    @achievements = Achievement.all
---
SELECT "students".* FROM "students"
SELECT "achievements".* FROM "achievements"